johnny49r/BLUE_PILL_RTC/RTC/src/STM32LIBS_RTC.cpp
/**
   ******************************************************************************
  * @file    STM32Libs_RTC.cpp
  * @author  John Hoeppner @Abbycus Consultants
  * @version V1.0.0
  * @date    June 2020
  * @brief   RTC library for STM32F10x using Arduino framework
  * 
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2017 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  * 
  *
  ******************************************************************************
  *
  ******************************************************************************
  */

#include "STM32LIBS_RTC.h"

const char *dayNames[7] = {"Sunday", "Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday"};
const char *monthNames[12] = {"January", "February", "March", "April", "May", "June", "July", "August", "September", "October", "November", "December"};

/********************************************************************
 **   @brief initialize the RTC
 **   @param initAction: Reset date/time or do a complete RTC domain reset.
 **   @return None
\*******************************************************************/
void STM32LIBS_RTC::begin(uint8_t initAction)
{
  bool resetRTC = false;
  /*
   ** Do basic RTC initialization. This may be redundant on a reset or power on.
   ** Determine the state of the RTC. Possible states are:
   ** 1) RTC domain has been reset. 
   ** 2) Date time have not been set.
   ** 3) Alarm has been set.
  */
  RCC_APB1ENR |= PWREN;                     // power & backup interface clocks enabled
  PWR_CR |= DBP;                            // allow access to RTC domain
  
  getBackup(0, 10);                         // get all backup registers 
  if (initAction == INIT_TIME_RESET) 
  {
    RTC_CRH &= ~(RTC_ALRIE | RTC_SECIE);    // clear alarm & seconds interrupt
    rtc_config(CONFIG_ENTER);
    RTC_CNTH = 0x0UL;
    RTC_CNTL = 0x0UL;
    RTC_ALRH = 0x0UL;
    RTC_ALRL = 0x0UL;
    rtc_config(CONFIG_ENTER);
    _statusFlagChange((BACKUP_TIME_SET_FLAG | BACKUP_ALARM_SET_FLAG), false);    // clear internal time & alarm flags
    disableAlarm();
  }
  else if(initAction == INIT_ALARM_RESET)
  {
    disableAlarm();
  }
  else if(initAction == INIT_RTC_RESET)     // the big bang!
  {
    resetRTC = true;
  }

  /*
   ** Force LSE clock which is the external 32.768 KHz osc. It keeps running when Vbat is powered
   ** by an external battery.
  */
  _clockSource = LSE_CLOCK;
  setClockSource(_clockSource);
    
  /*
   ** init the RTC
  */
  RTC_init(HOUR_FORMAT_24,
           (_clockSource == LSE_CLOCK) ? ::LSE_CLOCK :
           (_clockSource == HSE_CLOCK) ? ::HSE_CLOCK : ::LSI_CLOCK
#if defined(STM32_CORE_VERSION) && (STM32_CORE_VERSION  > 0x01050000)
             , resetRTC
#endif
          );
  /*
   ** set configuration flag in backup regs
  */             
  _statusFlagChange(BACKUP_CONFIGURED_FLAG, true);    // set internal configured flag

}


/********************************************************************
 **   @brief Deinitialize and stop the RTC
 **   @param None
 **   @returns Nothing
\*******************************************************************/
void STM32LIBS_RTC::end(void)
{
  if (isConfigured()) 
  {
    RTC_CRL = 0x0;            // clear interrupts and pending flags
    RTC_CRH = 0x0;
    _statusFlagChange((BACKUP_CONFIGURED_FLAG | BACKUP_TIME_SET_FLAG | BACKUP_ALARM_SET_FLAG), false); // clear all rtc flags 
  }
}


/********************************************************************
 **   @brief Gets the RTC clock source (should be LSE_CLOCK).
 **   @returns clock source: LSI_CLOCK, LSE_CLOCK or HSE_CLOCK
\*******************************************************************/
STM32LIBS_RTC::Source_Clock STM32LIBS_RTC::getClockSource(void)
{
  return _clockSource;
}


/********************************************************************
 **   @brief Sets the RTC clock source. By default LSI clock is selected. This
 **     method is called from begin().
 **   @param source: clock source: LSI_CLOCK, LSE_CLOCK or HSE_CLOCK
 **   @returns Nothing
\*******************************************************************/
void STM32LIBS_RTC::setClockSource(Source_Clock source)
{
  if (IS_CLOCK_SOURCE(source)) {
    _clockSource = source;
    RTC_SetClockSource((_clockSource == LSE_CLOCK) ? ::LSE_CLOCK :
                       (_clockSource == HSE_CLOCK) ? ::HSE_CLOCK : ::LSI_CLOCK);
  }
}

/********************************************************************
 **   @brief  get user (a)synchronous prescaler values if set else computed
 **     ones for the current clock source.
 **   @param  predivA: pointer to the current Asynchronous prescaler value
 **   @param  predivS: pointer to the current Synchronous prescaler value
 **   @retval None
\*******************************************************************/
void STM32LIBS_RTC::getPrediv(int8_t *predivA, int16_t *predivS)
{
  if ((predivA != nullptr) && (predivS != nullptr)) 
  {
    RTC_getPrediv(predivA, predivS);
  }
}

