johnny49r/BLUE_PILL_RTC/RTC/src/STM32LIBS_RTC.cpp
/********************************************************************
  * @brief  set user (a)synchronous prescalers value.
  * @note   This method must be called before begin().
  * @param  predivA: Asynchronous prescaler value. Reset value: -1
  * @param  predivS: Synchronous prescaler value. Reset value: -1
  * @retval None
\*******************************************************************/
void STM32LIBS_RTC::setPrediv(int8_t predivA, int16_t predivS)
{
  RTC_setPrediv(predivA, predivS);
}


/********************************************************************
  * @brief  Set & enable alarm using date & time values
  * @param  pointer to RTC_datetime_t structure containing the alarm
  * @retval None
\*******************************************************************/
uint8_t STM32LIBS_RTC::setAlarmDateTime(RTC_datetime_t *alarm_datetime)
{
  uint8_t retn;
  uint32_t alarm_epoch = dateTimeToEpoch(alarm_datetime);

  if(alarm_datetime->hour_format == RTC_HOUR_FORMAT_12 && alarm_datetime->am_pm == RTC_HOUR_PM)
  {
    alarm_epoch += (SECS_PER_DAY / 2);
  }

  if(alarm_epoch <= getEpoch())    // alarm must be in the future
    retn = RTC_INVALID_PARAM;
  else
    retn = setAlarmFromEpoch(alarm_epoch);

  return retn;
}


/********************************************************************
  * @brief  Set & enable alarm using an epoch number
  * @param  epoch - 32 bit number of seconds since 1970
  * @retval None
\*******************************************************************/
uint8_t STM32LIBS_RTC::setAlarmFromEpoch(uint32_t alarm_epoch)
{
  uint8_t retn = RTC_OK;
  if(alarm_epoch <= getEpoch())   // alarm must be > current time
    return RTC_INVALID_PARAM;

  __disable_irq();

  // disable RTC alarm interrupt 
  RTC_CRH &= ~RTC_ALRIE;

  // write the alarm registers
  retn = rtc_config(CONFIG_ENTER);
  RTC_ALRH = alarm_epoch >> 16;
  RTC_ALRL = alarm_epoch & 0xFFFF;
  retn = rtc_config(CONFIG_EXIT);

  // clear RTC alarm pending flag in CRL reg
  RTC_CRL &= ~RTC_CRL_ALARMF;
  // enable RTC alarm interrupt flag in CRH reg
  RTC_CRH |= RTC_ALRIE;
  // enable alarm interrupt in EXTI IMR reg
  EXTI_IMR |= EXTI_LINE17;
  // set EXTI rising edge alarm trigger 
  EXTI_RTSR |= EXTI_LINE17; 

  __enable_irq();

  _statusFlagChange(BACKUP_ALARM_SET_FLAG, true);
  return retn;
}


/********************************************************************
  * @brief  disable the RTC alarm.
  * @retval None
\*******************************************************************/
void STM32LIBS_RTC::disableAlarm(void)
{
  if (isConfigured()) 
  {
    RTC_CRL &= ~RTC_CRL_ALARMF;               // clear alarm flag
    RTC_CRH &= ~RTC_ALRIE;
    _statusFlagChange(BACKUP_ALARM_SET_FLAG, false);
  }
}


/********************************************************************
  * @brief  attach a callback to the RTC alarm interrupt.
  * @param  callback: pointer to the callback function
  * @retval None
  * 
\*******************************************************************/
void STM32LIBS_RTC::attachInterrupt(voidFuncPtr callback, void *data)
{
  attachAlarmCallback(callback, data);
}


/********************************************************************
  * @brief  detach the RTC alarm callback.
  * @param  None
  * @retval None
\*******************************************************************/
void STM32LIBS_RTC::detachInterrupt(void)
{
  detachAlarmCallback();
}

// Kept for compatibility. Use STM32LowPower library.
void STM32LIBS_RTC::standbyMode(void)
{

}

/********************************************************************
  * @brief  Get weekday name.
  * @param  DOW (0 - 6), 0 == "Sunday"
  * @retval returns a char * to the name of the week.
\*******************************************************************/
char* STM32LIBS_RTC::getWeekdayName(uint8_t DOW)
{
  if(DOW > 6)
    DOW = 0;
  char *pStr = (char *)dayNames[DOW];
  return pStr;
}


/********************************************************************
  * @brief  Get month name.
  * @param  month (1 - 12), 1 == "January"
  * @retval returns a char * to the name of the month.
\*******************************************************************/
char* STM32LIBS_RTC::getMonthName(uint8_t month)
{
  if(month > 12)
    month = 1;
  char *pStr = (char *)monthNames[month -1];
  return pStr;
}


/********************************************************************
  *  @brief  configure RTC source clock for low power
  *  @param  none
\*******************************************************************/
void STM32LIBS_RTC::configForLowPower(Source_Clock source)
{
#if defined(HAL_PWR_MODULE_ENABLED)
  #ifdef _IGNORE
  if (!_configured) {
    _clockSource = source;
    // Enable RTC
    //begin();
  } else {
    if (_clockSource != source) {
      // Save current config
      AM_PM period, alarmPeriod = _alarmPeriod;
      uint32_t subSeconds;
      uint8_t seconds, minutes, hours, weekDay, day, month, years;
      uint8_t alarmSeconds, alarmMinutes, alarmHours, alarmDay;
      Alarm_Match alarmMatch = _alarmMatch;
      bool alarmEnabled = _alarmEnabled;

      alarmDay = _alarmDay;
      alarmHours = _alarmHours;
      alarmMinutes = _alarmMinutes;
      alarmSeconds = _alarmSeconds;

      getDate(&weekDay, &day, &month, &years);
      getTime(&seconds, &minutes, &hours, &subSeconds, &period);

      end();
      _clockSource = source;
      // Enable RTC
      //begin(period);
      // Restore config
      setTime(seconds, minutes, hours, subSeconds, period);
      setDate(weekDay, day, month, years);
      setAlarmTime(alarmHours, alarmMinutes, alarmSeconds, alarmPeriod);
      setAlarmDay(alarmDay);
      if (alarmEnabled) {
        enableAlarm(alarmMatch);
      }
    }
  }
  #endif
#endif
}


/******************************************************************************
**    @brief Writes an array of user data to the STM32F1xx data registers. Up to 9 
**    16-bit values can be stored and these registers are non-volatile if the 
**    Vbat input is powered with a coin-cell or other equivalent power source.
**    @param data_array - pointer to user data array.
**    @param indx - User register (0 - 8)
**    @param len - number of registers to read (1 - 9).
**    @note: The datasheet says there are 42 regs available but not all devices
**      support more than 10.
**      Indx + len should not be greater than 9.
\*****************************************************************************/
void STM32LIBS_RTC::eepromWrite(uint16_t data_array[], uint8_t indx, uint8_t len)
{
  uint8_t i;
  uint8_t _indx = indx;

  indx += 1;                // can't use first reg
  for(i=0; i<len; i++)
  {
    if(indx > 9)
      break;

    _RTC_BackupRegs[indx++] = data_array[i];
  }
  setBackup(_indx+1, len);
}


