johnny49r/BLUE_PILL_RTC/RTC/src/STM32LIBS_RTC.cpp
/******************************************************************************
**    @brief Reads user data from the RTC backup registers (poor mans EEPROM)
**      Up to nine (9) 16-bit values can be read and these registers are non-volatile 
**      if the Vbat input is powered with a coin-cell or other equivalent power.
**    @param data_array - pointer to user data array.
**    @param indx - User register (0 - 8)
**    @param len - number of registers to read.
**    @note indx + len should not be greater than 9.
\*****************************************************************************/
void STM32LIBS_RTC::eepromRead(uint16_t data_array[], uint8_t indx, uint8_t len)
{
  uint8_t i;
  uint8_t _indx = indx;

  if(data_array != NULL)
  {
    getBackup(indx+1, len);         // read backup regs into local array
    indx = _indx+1;
    for(i=0; i<len; i++)
    {
      if(indx > 9)
        return;

      data_array[i] = _RTC_BackupRegs[indx++];  // copy local array to caller array
    }
  }
}


/******************************************************************************
**    setBackup()
**
**    Private access to first four STM32F10x backup regs. These are used to
**    store status and alarm settings during power down. There are 42 16-bit
**    registers that are non-volatile if the Vbat input is powered with a 
**    coin-cell or other equivalent power source.
\*****************************************************************************/
void STM32LIBS_RTC::setBackup(uint8_t indx, uint8_t len)
{
  pBkpRegs pb;
  pb = reinterpret_cast<BACKUP_REGS *>(BKP_REG_BASE + 0x00000004);

  while(len > 0)
  {
    if(indx > 9)
      break;

    pb->bkup_regs[indx] = _RTC_BackupRegs[indx];
    indx++;
    len--;
  }
  
}
      
      
/******************************************************************************
**    getBackup()
**
**    Reads up to 42 half word (16 bit) values from the STM32F10x backup regs.
**    The backup regs are non-volatile if the Vbat input is powered with a 
**    coin-cell or other 3V power source.
\*****************************************************************************/      
void STM32LIBS_RTC::getBackup(uint8_t indx, uint8_t len)
{
  pBkpRegs pb;
  pb = reinterpret_cast<BACKUP_REGS *>(BKP_REG_BASE + 0x00000004);

  while(len > 0)
  {
    if(indx > 9)
      break;
    
    _RTC_BackupRegs[indx] = (uint16_t)(pb->bkup_regs[indx] & 0xFFFF);
    indx++;
    len--;
  }
}


/******************************************************************************
**    clearBackup()
**
**    Clears all backup registers. *** WARNING *** this resets the RTC domain 
**    including time and alarm settings.
\*****************************************************************************/ 
void STM32LIBS_RTC::clearBackup(void)
{
   RCC_BDCR |= BKP_RESET;     // assert BDRST
   RCC_BDCR &= ~BKP_RESET;     // deassert BDRST

   // backup domain reset disables RTC access - reenable
   PWR_CR |= DBP;
}


/******************************************************************************
// setDateTime()
//
// datetime - ptr to _dateTimeStruct
// useRaw: if true use 'time_stamp' to set RTC count register. Otherwise convert
// date & time info in datetime to a 32 bit value representing the number of 
// seconds since midnight of Jan 1, 2000.
\*****************************************************************************/
void STM32LIBS_RTC::setDateTime(RTC_datetime_t *datetime)
{
  if(isConfigured())
  {
    uint32_t _epoch = dateTimeToEpoch((RTC_datetime_t *)datetime); // convert date/time units to 32 bit epoch
    //
    // if 12 hour format add extra 12 hours for PM
    //
    if(datetime->hour_format == RTC_HOUR_FORMAT_12 && datetime->am_pm == RTC_HOUR_PM)
    {
      _epoch += (SECS_PER_DAY / 2);
    }
    setEpoch(_epoch);
  }
}


/******************************************************************************
**    @brief Gets the current time from the RTC count register and calculates
**      date & time elements from the 'epoch'. This is non-volatile if
**      power if not lost or if Vbat is powered by an external battery.
**    @param datetime - ptr to RTC_datetime_t structure to fill.
**    @param hour_format - if unspecified, the format will use the hour_format
**      specified in the RTC_datetime_t structure. Otherwise the format will 
**      use the optional hour_format parameter. 
**    @note If the optional hour_format parameter is used this value becomes the
**      new default format.
**
\*****************************************************************************/
void STM32LIBS_RTC::getDateTime(RTC_datetime_t *_datetime, uint8_t hour_format)
{
  //uint8_t _hour_fmt;
  if(hour_format != RTC_HOUR_FORMAT_UNDEF)
    _datetime->hour_format = hour_format;

  // epochToDateTime always yeilds 24 hour time
  epochToDateTime((RTC_datetime_t *)_datetime, getEpoch());

  // if 12 hour format is requested, convert to 12 hour AM/PM
  if(_datetime->hour_format == RTC_HOUR_FORMAT_12)
  {
    _datetime->am_pm = (_datetime->hours >= 12) ? RTC_HOUR_PM : RTC_HOUR_AM;
    _datetime->hours %= 12;
    if(_datetime->hours == 0)
       _datetime->hours = 12;               // no zero o'clock
  }
  else
    _datetime->am_pm = RTC_HOUR_AM;         // default - its AM
}


/******************************************************************************
**    @brief Gets the epoch from the RTC count regs (num of secs from 1970)
**
**    @return 32 bit epoch 
**
\*****************************************************************************/
uint32_t STM32LIBS_RTC::getEpoch(void)
{
   uint32_t _tm;
   _tm = (RTC_CNTH << 16UL) | RTC_CNTL;
   return _tm;
}

/******************************************************************************
**    @brief Sets the epoch number in the RTC count regs (num of secs from 1970)
**    @param _epoch - 32 bit number of seconds since 1970
**
\*****************************************************************************/
void STM32LIBS_RTC::setEpoch(uint32_t _epoch)
{
  __disable_irq();

  rtc_config(CONFIG_ENTER);
  RTC_CNTH = _epoch >> 16;
  RTC_CNTL = _epoch & 0xFFFF;
  rtc_config(CONFIG_EXIT);

  __enable_irq();

  _statusFlagChange(BACKUP_TIME_SET_FLAG, true);
}


