johnny49r/BLUE_PILL_RTC/RTC/src/STM32LIBS_RTC.cpp
/******************************************************************************
**    @brief Converts date / time elements to a 32 bit epoch (num of secs since 1970).
**
**    @param datetime - ptr to RTC_datetime_t structure containing datetime elements.
**    @returns A 32 bit epoch.
**    @note: The epoch variable in the datetime struct is updated also.
**
\*****************************************************************************/
uint32_t STM32LIBS_RTC::dateTimeToEpoch(RTC_datetime_t *datetime)
{
  int16_t i;
  uint32_t _seconds;   
  int16_t _year = (datetime->year - 1970);    // 1970 is the beginning of time!

  if(_year < 0)
    _year = 0;

   // seconds from 1970 till 1 jan 00:00:00 of the given year
   _seconds = _year * (SECS_PER_DAY * 365);
   for (i = 0; i < _year; i++) {
      if (IS_LEAP_YEAR(i)) {
         _seconds += SECS_PER_DAY;   // add extra days for leap years
      }
   }
  
   // add days for this year, months start from 1
   for (i = 1; i < datetime->month; i++) 
   {
      if ( (i == 2) && IS_LEAP_YEAR(_year)) 
      { 
         _seconds += SECS_PER_DAY * 29;
      } 
      else 
      {
         _seconds += SECS_PER_DAY * monthDays[i-1];  // monthDay array starts from 0
      }
   }
   _seconds += (datetime->day-1) * SECS_PER_DAY;
   _seconds += datetime->hours * SECS_PER_HOUR;
   _seconds += datetime->minutes * SECS_PER_MIN;
   _seconds += datetime->seconds;
   datetime->epoch = _seconds;
   return (uint32_t) _seconds; 
}


/******************************************************************************
**    @brief Converts a 32 bit epoch value to date & time elements.
**
**    @param datetime - ptr to RTC_datetime_t structure to fill with datetime elements.
**    @param _epoch - 32 bit number of seconds since 1970.
**    @note - Date & Time are returned in 24 hour format. Caller must convert to
**      12 hour format if needed.
**
\*****************************************************************************/
void STM32LIBS_RTC::epochToDateTime(RTC_datetime_t *datetime, uint32_t _epoch)
{
   // working variables
   uint8_t _month, monthLength;
   uint32_t _days = 0;
   uint32_t _time = _epoch;

   datetime->epoch = _epoch;
   datetime->seconds = _time % 60;
   _time /= 60;                     // time = minutes
   datetime->minutes = _time % 60;
   _time /= 60;                     // time = hours
   datetime->hours = _time % 24;
   _time /= 24;                     // time = days
   // calc day of the week
   datetime->weekday = ((_time + 4) % 7);   // jan 1 1970 was a thursday
 
   datetime->year = 0;
   while((unsigned)(_days += (IS_LEAP_YEAR(datetime->year) ? 366 : 365)) <= _time) 
   {
      datetime->year++;
   }

   _days -= IS_LEAP_YEAR(datetime->year) ? 366 : 365;
   _time -= _days; // now it is days in this year, starting at 0
  
   _days = 0;
   monthLength = 0;
   for (_month=0; _month<12; _month++) 
   {
      if (_month == 1) // february
      { 
         if (IS_LEAP_YEAR(datetime->year)) 
         {
         monthLength = 29;
         } 
         else 
         {
         monthLength=28;
         }
      } 
      else 
      {
         monthLength = monthDays[_month];
      }
    
      if (_time >= monthLength) 
      {
         _time -= monthLength;
      } 
      else 
      {
         break;
      }
   }
   datetime->year += 1970;
   datetime->month = _month + 1;  // jan is month 1  
   datetime->day = _time + 1;     // day of month starting with 1
}


/******************************************************************************
**    @brief RTC register CONFIGURATION mode enable/disable.
**
**    @param _config - CONFIG_ENTER or CONFIG_EXIT
**    @note The RTC count, alarm, or prescale regs can only be update when 
**      configuration mode is enabled.
**
\*****************************************************************************/
uint8_t STM32LIBS_RTC::rtc_config(uint8_t _config)
{
  uint32_t tmo = millis();
  uint8_t retn = RTC_OK;

  switch(_config)
  {
    case CONFIG_ENTER:
      while((RTC_CRL & RTOFF) == 0)       // wait for last write to terminate
      {
        if(millis() - tmo > REG_TIMEOUT)
        {
          retn = RTC_FAIL_CONFIG_ENTER;
          break;
        }
      }    
      if(retn == RTC_OK)
      {
        RTC_CRL |= CNF;                  // enter config mode
        RTC_CRL &= ~RSF;                 // clear the reg sync flag 
      }
      break;

    case CONFIG_EXIT:
      RTC_CRL &= ~CNF;                    // exit config mode
      while((RTC_CRL & RTOFF_RSF) != RTOFF_RSF)    // wait for last write & reg sync
      {       
        if(millis() - tmo > REG_TIMEOUT)
        {
          retn = RTC_FAIL_CONFIG_EXIT;
          break;
        }
      }    
      break;         
   }
   return retn;
}


/******************************************************************************
**    Change status flags in backup register.
**
**    Maintains the state of time, alarm, and configuration set.
**
\*****************************************************************************/
void STM32LIBS_RTC::_statusFlagChange(uint16_t sbit, bool fset)
{
  if(fset)
    _RTC_BackupRegs[0] |= sbit;
  else   
    _RTC_BackupRegs[0] &= ~sbit;

  setBackup(0, 1);
}
